{
  "backend/main.mo": "Motoko actor managing menu items, transactions, and gift cards with CRUD operations and sorting helpers.",
  "feature_evidence.json": "Metadata describing a deployment-related feature, listing involved frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten descriptions summarizing various frontend files and their roles in the POS app.",
  "frontend/index.css": "Tailwind-based global styles defining OKLCH color variables and light/dark theme tokens for the UI.",
  "frontend/index.html": "Base HTML document defining page metadata, favicon, and React root mount point.",
  "frontend/src/App.tsx": "Main React app component handling tab navigation and receipt flow between POS, menu, gift card, history, and receipt views.",
  "frontend/src/components/common/ErrorState.tsx": "Reusable error display component featuring an alert icon, message, and optional retry button.",
  "frontend/src/components/layout/AppLayout.tsx": "App layout wrapper providing header with branding, main content container, and footer with attribution link.",
  "frontend/src/features/checkout/CheckoutDialog.tsx": "Checkout modal supporting cash, gift card, and simulated card payments with validation and error handling.",
  "frontend/src/features/checkout/SimulatedCardForm.tsx": "Simulated credit card input form with formatting, validation, and a notice that payments are fake.",
  "frontend/src/features/giftcards/GiftCardsScreen.tsx": "No summary available.",
  "frontend/src/features/menu/MenuItemForm.tsx": "A dialog form for creating or editing menu items with validation for name, price, and optional category.",
  "frontend/src/features/menu/MenuManagementScreen.tsx": "Displays and manages the menu list, allowing adding, editing, and deleting items via hooks and a form modal.",
  "frontend/src/features/pos/POSScreen.tsx": "POS interface for adding menu items to a cart, adjusting quantities, and launching checkout to complete a sale.",
  "frontend/src/features/receipts/ReceiptScreen.tsx": "Shows a printable receipt for a completed transaction, including items, totals, and payment details.",
  "frontend/src/features/transactions/TransactionsScreen.tsx": "Lists all past transactions with summary details and allows viewing individual receipts.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on Internet Identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useCompleteTransaction.ts": "Provides a mutation to submit a transaction to the backend and store the resulting receipt locally.",
  "frontend/src/hooks/useGiftCards.ts": "Defines mutations for issuing, fetching, and using gift cards through the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity context and provider, handling auth client creation, login, logout, and identity persistence.",
  "frontend/src/hooks/useMenu.ts": "Provides queries and mutations for fetching and modifying menu items via the backend actor.",
  "frontend/src/index.css": "Tailwind base styles and custom color variables for light/dark themes plus print styling rules.",
  "frontend/src/main.tsx": "Bootstraps the app with React, QueryClientProvider, and InternetIdentityProvider.",
  "frontend/src/state/transactionsStore.ts": "Zustand store that persists completed transactions and supports adding and clearing them.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, typography, container queries, and animations.",
  "project_state.json": "Metadata describing project state, issues, features, and image requirements for the build."
}