{
  "backend/main.mo": "Motoko canister managing menu items, transactions, gift cards, and custom credit cards with CRUD operations and sorting functions.",
  "feature_evidence.json": "Feature evidence report listing removed QR-card UI features, affected files, and related components for build planning.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files detailing their roles in the POS app and recent QR feature removals.",
  "frontend/index.css": "Tailwind base and theme variable definitions establishing the app’s warm color palette and dark mode values.",
  "frontend/index.html": "HTML entry point defining root element and loading the main React script with favicon.",
  "frontend/src/App.tsx": "Top-level React component managing navigation tabs and receipt state across POS, menu, gift card, transactions, and receipt screens.",
  "frontend/src/components/common/ErrorState.tsx": "Reusable error display with icon, message, and optional retry button.",
  "frontend/src/components/layout/AppLayout.tsx": "App layout wrapper providing header, footer, and main content structure with branding.",
  "frontend/src/features/checkout/CheckoutDialog.tsx": "Checkout dialog handling fake cash and gift card payments, validation, and transaction completion.",
  "frontend/src/features/checkout/QRCardPaymentPanel.tsx": "Empty file placeholder for removed QR credit card payment panel.",
  "frontend/src/features/checkout/SimulatedCardForm.tsx": "Simulated credit card input form that validates name, number, expiry, and CVC and reports validity upward.",
  "frontend/src/features/custom-cards/CustomCreditCardsScreen.tsx": "Empty placeholder file with no implemented UI or logic.",
  "frontend/src/features/custom-cards/QRCodeBadge.tsx": "Empty placeholder file with no implemented UI or logic.",
  "frontend/src/features/giftcards/GiftCardsScreen.tsx": "Allows issuing new gift cards and looking up existing ones with form inputs, mutations, and error handling.",
  "frontend/src/features/menu/MenuItemForm.tsx": "Dialog form for adding or editing a menu item with validation for name, price, and optional category.",
  "frontend/src/features/menu/MenuManagementScreen.tsx": "Displays and manages a list of menu items with add, edit, and delete actions backed by menu hooks.",
  "frontend/src/features/pos/POSScreen.tsx": "POS interface for adding menu items to a cart, adjusting quantities, and initiating checkout.",
  "frontend/src/features/receipts/ReceiptScreen.tsx": "Displays a printable receipt for a completed transaction with item breakdown and totals.",
  "frontend/src/features/transactions/TransactionsScreen.tsx": "Displays a transaction history table with receipt viewing and an empty state message. Pulls transactions from Zustand store and renders summary info.",
  "frontend/src/hooks/useActor.ts": "Initializes and manages the backend actor based on Internet Identity, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useCompleteTransaction.ts": "Handles completing a transaction via the backend and stores the resulting transaction locally with a generated receipt ID.",
  "frontend/src/hooks/useCustomCreditCards.ts": "Empty placeholder hook file with no implementation.",
  "frontend/src/hooks/useGiftCards.ts": "Provides mutations for issuing gift cards, retrieving gift card details, and processing gift card payments using the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity auth provider and hook for managing identity state, login flow, and AuthClient setup.",
  "frontend/src/hooks/useMenu.ts": "Fetches menu items and provides mutations for adding, editing, and removing menu items via the backend actor.",
  "frontend/src/index.css": "Defines Tailwind base styles, theme variables, utility classes, and print styles for the app.",
  "frontend/src/main.tsx": "App entry point that initializes React, React Query, Internet Identity provider, and global styles.",
  "frontend/src/state/transactionsStore.ts": "Zustand store that persists transactions and provides methods to add and clear them.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling theming, plugins, custom colors, fonts, and layout settings.",
  "project_state.json": "Project metadata describing existing features, requirements, and pending requests for reverting QR-based credit card features."
}