{
  "backend/main.mo": "Motoko canister handling menu items, transactions, and gift cards with add/edit/remove, sorting, and payment recording logic.",
  "feature_evidence.json": "Aggregated feature-to-file mapping documenting which frontend files implement each POS feature for traceability.",
  "frontend-file-summaries.txt": "Plain-text JSON object summarizing the purpose of each frontend file for quick reference.",
  "frontend/index.css": "Tailwind base stylesheet defining the app’s color system, themes, and global CSS variables.",
  "frontend/index.html": "Root HTML file loading the React app and mounting it to the root div.",
  "frontend/src/App.tsx": "Main app component managing tab navigation and routing between POS, menu, gift cards, transactions, and receipts.",
  "frontend/src/components/common/ErrorState.tsx": "Reusable error display component with message, icon, and optional retry button.",
  "frontend/src/components/layout/AppLayout.tsx": "App layout wrapper providing header, footer, branding, and shared page structure.",
  "frontend/src/features/checkout/CheckoutDialog.tsx": "Checkout modal implementing fake cash, gift card, and simulated card payments with validation and transaction submission.",
  "frontend/src/features/checkout/SimulatedCardForm.tsx": "A simulated card entry form with basic formatting and validation that reports validity to a parent component.",
  "frontend/src/features/giftcards/GiftCardsScreen.tsx": "Provides interfaces to issue new gift cards and look up existing ones using hooks for API operations.",
  "frontend/src/features/menu/MenuItemForm.tsx": "Dialog form for creating or editing menu items with validation for name, price, and optional category.",
  "frontend/src/features/menu/MenuManagementScreen.tsx": "Displays menu items with options to add, edit, and delete using form dialogs and confirmation prompts.",
  "frontend/src/features/pos/POSScreen.tsx": "Point‑of‑sale interface that lets users add menu items to a cart, modify quantities, and proceed to checkout.",
  "frontend/src/features/receipts/ReceiptScreen.tsx": "Renders a printable receipt for a completed transaction and allows navigating back to the POS.",
  "frontend/src/features/transactions/TransactionsScreen.tsx": "Displays a transaction history table using stored transactions and allows viewing individual receipts.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, invalidating related queries when the identity changes.",
  "frontend/src/hooks/useCompleteTransaction.ts": "Sends completed transactions to the backend and stores them locally with a generated receipt ID.",
  "frontend/src/hooks/useGiftCards.ts": "Provides mutations for issuing, retrieving, and using gift cards through the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication, exposing identity state, login, logout, and status via context.",
  "frontend/src/hooks/useMenu.ts": "Fetches and mutates menu items through the backend actor, invalidating menu queries on changes.",
  "frontend/src/index.css": "Defines Tailwind base styles, custom color variables, dark mode settings, and print-specific rules.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity providers.",
  "frontend/src/state/transactionsStore.ts": "Zustand store persisting transaction history with methods to add and clear transactions.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, container settings, and enabling plugins.",
  "project_state.json": "Defines the project’s current POS app state, including versioning, feature list, image requirements, and architectural notes. Describes existing features like menu management, checkout with fake payments, gift cards, and receipts."
}