{
  "backend/main.mo": "Main actor implementing menu, transactions, gift cards, and custom credit card management with add/edit/remove operations and sorting utilities.",
  "backend/migration.mo": "Migration module upgrading old actor state by adding the customCreditCards map while preserving existing data.",
  "feature_evidence.json": "Feature evidence report listing features, related files, components, and test IDs with confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files describing their roles in the POS app UI and logic.",
  "frontend/index.css": "Global Tailwind styles defining the app’s color system, themes, and base layout rules.",
  "frontend/index.html": "Root HTML document setting up favicon, app title, and root mount point for the React app.",
  "frontend/src/App.tsx": "Main React component controlling tab navigation and coordinating POS, menu, cards, gift cards, transactions, and receipt screens.",
  "frontend/src/components/common/ErrorState.tsx": "Reusable error display component with optional retry button and visual alert state.",
  "frontend/src/components/layout/AppLayout.tsx": "App layout wrapper providing header, footer, and page scaffolding with branding and attribution.",
  "frontend/src/features/checkout/CheckoutDialog.tsx": "Implements the checkout dialog handling cash, gift card, and QR credit card payments, including validation and transaction completion. Manages form state, errors, and invokes mutations before triggering success callbacks.",
  "frontend/src/features/checkout/QRCardPaymentPanel.tsx": "Provides a QR scanner and manual entry UI for submitting card tokens, handling scanning states, validation, and fallback modes. Calls onScanned when a token is captured or entered.",
  "frontend/src/features/checkout/SimulatedCardForm.tsx": "Renders a simulated credit card entry form with formatting and validity checks, notifying the parent when the input becomes valid. No real payments are processed.",
  "frontend/src/features/custom-cards/CustomCreditCardsScreen.tsx": "UI for creating and managing custom credit cards with unique QR payloads, including card generation, validation, error handling, and deletion. Stores cards locally and displays QR codes.",
  "frontend/src/features/custom-cards/QRCodeBadge.tsx": "Displays a QR code image generated via Google Charts along with its encoded value. Allows configurable size and optional value display.",
  "frontend/src/features/giftcards/GiftCardsScreen.tsx": "Provides interfaces to issue new gift cards and look up existing ones, supporting code generation, balance entry, querying, and error handling. Shows results or descriptive validation messages.",
  "frontend/src/features/menu/MenuItemForm.tsx": "Dialog form for adding or editing menu items with validation for name, price, and optional category. Submits cleaned values to the parent via onSubmit.",
  "frontend/src/features/menu/MenuManagementScreen.tsx": "UI for listing, adding, editing, and deleting menu items using menu-related hooks and a form dialog.",
  "frontend/src/features/pos/POSScreen.tsx": "POS interface that loads menu items, manages a cart, and initiates checkout with a dialog.",
  "frontend/src/features/receipts/ReceiptScreen.tsx": "Displays a completed transaction receipt with print support and navigation back to POS.",
  "frontend/src/features/transactions/TransactionsScreen.tsx": "Shows a table of past transactions with summary details and links to view receipts.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on Internet Identity, refetching dependent queries on change.",
  "frontend/src/hooks/useCompleteTransaction.ts": "Mutation hook that sends completed transactions to the backend and stores them locally with a generated receipt ID.",
  "frontend/src/hooks/useCustomCreditCards.ts": "Provides mutations for adding and validating custom credit cards through the backend.",
  "frontend/src/hooks/useGiftCards.ts": "Hooks for issuing, retrieving, and using gift cards via backend actor calls.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including loading, logging in, clearing, and tracking login status. Wraps AuthClient creation and exposes identity state through a custom hook.",
  "frontend/src/hooks/useMenu.ts": "Defines React Query hooks to fetch, add, edit, and remove menu items via the backend actor. Automatically invalidates the menu query after mutations.",
  "frontend/src/index.css": "Tailwind CSS setup with custom color variables, dark mode styles, utility classes, and print-specific rules. Establishes the UI theme for the app.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers. Loads global styles and renders the main App component.",
  "frontend/src/state/transactionsStore.ts": "Zustand store persisting completed transactions, with actions to add new transactions and clear all data. Stores transaction details including items, totals, and timestamps.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom color tokens, fonts, container settings, and plugins. Extends the theme using design variables defined in CSS.",
  "project_state.json": "Describes the project’s state, including existing and pending feature requests for QR-based custom credit card payments. Defines requirements and metadata for ongoing development."
}