{
  "kind": "build_request",
  "title": "Revert POS UI to remove QR-code-based custom credit cards and scanner flow",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Remove the QR-code-based Custom Credit Cards feature from the main navigation by deleting the \"Cards\" tab and its screen from the app UI.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-10"
        ],
        "quotes": [
          "Um, go back to the normal design. I don't like the QR code thing anymore."
        ]
      },
      "acceptanceCriteria": [
        "The top-level tabs no longer include a \"Cards\" tab.",
        "Navigating the app does not render CustomCreditCardsScreen anywhere.",
        "The tab layout (e.g., grid columns) is updated so spacing/alignment remains correct."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Revert the Checkout dialog so it no longer offers a QR-based credit card payment method and no longer uses the in-app QR scanner flow.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-10"
        ],
        "quotes": [
          "go back to the normal design",
          "I don't like the QR code thing anymore."
        ]
      },
      "acceptanceCriteria": [
        "The payment method list in CheckoutDialog does not show \"QR Credit Card\".",
        "CheckoutDialog does not render QRCardPaymentPanel and does not attempt to start/stop camera scanning.",
        "Completing a purchase works using the remaining payment methods (e.g., Fake Cash and Gift Card) without referencing QR/card token validation."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Remove unused QR/custom-card frontend modules and dependencies from the build after the UI is reverted (components, hooks, and imports related to custom QR credit cards and scanning).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-10"
        ],
        "quotes": [
          "I don't like the QR code thing anymore."
        ]
      },
      "acceptanceCriteria": [
        "No remaining imports/reference usages of useCustomCreditCards, QRCodeBadge, CustomCreditCardsScreen, or QRCardPaymentPanel from active app code paths.",
        "The frontend TypeScript build completes without unused/failed import errors related to removed QR/custom-card modules.",
        "No network requests are made to the Google Charts QR code URL from the running app."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (Shadcn components are read-only).",
    "Do not edit any files listed in frontend.immutablePaths in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Removing or migrating existing backend state related to custom credit cards (backend can keep existing data; the feature should simply be removed from the UI/flow).",
    "Adding new payment providers or real payment processing."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}