{
  "kind": "build_request",
  "title": "Publish a working Version 1 draft and provide a shareable URL",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-12",
      "text": "Resolve the deployment/publish failure so the existing Version 1 POS app can be built and deployed successfully, producing a working shareable URL that loads the app UI and can make backend calls.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Make me a draft",
          "Give me a link to version one",
          "Your Version 1 link did not publish, so there’s no URL available yet.",
          "Deployment error"
        ]
      },
      "acceptanceCriteria": [
        "A fresh build completes without errors for both frontend and backend.",
        "Deployment/publish completes successfully and results in a shareable URL.",
        "Opening the URL loads the app without a blank screen or console-fatal runtime error.",
        "Core flows work from the deployed URL: viewing POS tab, viewing Menu tab, and at least one backend query/mutation succeeds (e.g., fetching menu or adding a menu item)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "Do not edit frontend immutable paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "User-facing text must be in English.",
    "Do not add real-money payment processing; payments must remain simulated/fake."
  ],
  "nonGoals": [
    "Implementing third-party authentication providers beyond Internet Identity.",
    "Adding external databases or non-IC backend services.",
    "Adding real-time features (WebSockets/push notifications/chat).",
    "Integrating real payment processors (e.g., Stripe) for actual charges."
  ],
  "imageRequirements": {
    "required": [
      "Playful cash register icon/mark in warm colors (pos-logo.dim_512x512.png)",
      "Cart/checkout empty-state illustration with simple shapes, warm palette (empty-cart.dim_1200x800.png)",
      "Gift card illustration (rounded card with pattern, warm palette) (gift-card-illustration.dim_1200x800.png)"
    ],
    "edits": []
  }
}