{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Remove QR-based custom credit cards and scanner flow from POS UI",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Remove the Cards tab and ensure the Custom Credit Cards screen is no longer reachable from the UI.",
      "acceptanceCriteria": [
        "The top-level tabs no longer include a \"Cards\" tab.",
        "Navigating the app does not render CustomCreditCardsScreen anywhere.",
        "The tab layout (e.g., grid columns) is updated so spacing/alignment remains correct."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Remove the \"Cards\" tab trigger and the associated TabsContent rendering CustomCreditCardsScreen; remove the CustomCreditCardsScreen import; update the TabsList grid column count so tab spacing/alignment remains correct."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Revert CheckoutDialog to remove the QR Credit Card payment method and eliminate the in-app QR scanner flow.",
      "acceptanceCriteria": [
        "The payment method list in CheckoutDialog does not show \"QR Credit Card\".",
        "CheckoutDialog does not render QRCardPaymentPanel and does not attempt to start/stop camera scanning.",
        "Completing a purchase works using the remaining payment methods (e.g., Fake Cash and Gift Card) without referencing QR/card token validation."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/checkout/CheckoutDialog.tsx",
          "operation": "modify",
          "description": "Remove the QR-based payment method option from the payment method RadioGroup; remove QRCardPaymentPanel rendering and all QR/card validation flow (including useCustomCreditCards usage and any scanner start/stop logic); simplify state and error handling to support only remaining methods (e.g., cash and gift card) and ensure completing a purchase still works. This change removes usage of the selected qr-code/camera capabilities (scanner hooks); verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Delete unused QR/custom-card modules and clean up imports so the frontend build no longer references QR/scanner or Google Charts QR generation.",
      "acceptanceCriteria": [
        "No remaining imports/reference usages of useCustomCreditCards, QRCodeBadge, CustomCreditCardsScreen, or QRCardPaymentPanel from active app code paths.",
        "The frontend TypeScript build completes without unused/failed import errors related to removed QR/custom-card modules.",
        "No network requests are made to the Google Charts QR code URL from the running app."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/checkout/QRCardPaymentPanel.tsx",
          "operation": "delete",
          "description": "Delete the QR-card payment panel module that embeds the QR scanner/manual token flow (removes usage of the selected qr-code scanner capability); verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/features/custom-cards/CustomCreditCardsScreen.tsx",
          "operation": "delete",
          "description": "Delete the Custom Credit Cards screen module so it cannot be referenced or bundled."
        },
        {
          "path": "frontend/src/features/custom-cards/QRCodeBadge.tsx",
          "operation": "delete",
          "description": "Delete the QRCodeBadge module that generates QR images via Google Charts to ensure the app no longer makes requests to the Google Charts QR code URL."
        },
        {
          "path": "frontend/src/hooks/useCustomCreditCards.ts",
          "operation": "delete",
          "description": "Delete the custom credit card hook module; ensure no remaining active imports/reference usages."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Confirm all imports/usages of CustomCreditCardsScreen are removed so there are no remaining references from active app code paths."
        },
        {
          "path": "frontend/src/features/checkout/CheckoutDialog.tsx",
          "operation": "modify",
          "description": "Remove imports and any remaining references to QRCardPaymentPanel and useCustomCreditCards so TypeScript builds cleanly without missing/unused import errors."
        }
      ]
    }
  ]
}