{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix V1 POS frontend publish/build reliability and wire required generated assets",
  "requirements": [
    {
      "id": "REQ-12",
      "summary": "Resolve frontend build/runtime issues that can prevent publish, and ensure deployed UI loads and can call the backend while wiring required generated assets into the UI.",
      "acceptanceCriteria": [
        "A fresh build completes without errors for both frontend and backend.",
        "Deployment/publish completes successfully and results in a shareable URL.",
        "Opening the URL loads the app without a blank screen or console-fatal runtime error.",
        "Core flows work from the deployed URL: viewing POS tab, viewing Menu tab, and at least one backend query/mutation succeeds (e.g., fetching menu or adding a menu item)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/layout/AppLayout.tsx",
          "operation": "modify",
          "description": "Remove/replace any unused or optional icon-library imports that can cause production build failures when dependencies are missing (e.g., eliminate unused react-icons imports), and keep header/footer rendering resilient for deployed environments. Verify the component's usage instructions before implementing (shadcn-ui, build-template-react, initial-app, core-infrastructure)."
        },
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Harden the HTML entry for deployment (add a proper doctype, ensure correct root mounting, and optionally wire a favicon using the generated POS mark) to reduce blank-screen risks on publish. Verify the component's usage instructions before implementing (build-template-react, initial-app, github-export-icp-cli)."
        },
        {
          "path": "frontend/public/assets/generated/pos-logo.dim_512x512.png",
          "operation": "create",
          "description": "Add the required generated asset at the exact path so deployed builds can load it (used by the header logo). Source asset: generated/pos-logo.dim_512x512.png."
        },
        {
          "path": "frontend/public/assets/generated/empty-cart.dim_1200x800.png",
          "operation": "create",
          "description": "Add the required generated asset at the exact path so deployed builds can load it (used by POS empty states). Source asset: generated/empty-cart.dim_1200x800.png."
        },
        {
          "path": "frontend/public/assets/generated/gift-card-illustration.dim_1200x800.png",
          "operation": "create",
          "description": "Add the required generated asset at the exact path so deployed builds can load it (used by Gift Cards screen illustration). Source asset: generated/gift-card-illustration.dim_1200x800.png."
        },
        {
          "path": "frontend/src/hooks/useMenu.ts",
          "operation": "modify",
          "description": "Make menu fetch/mutations more deployment-resilient (e.g., ensure queries are enabled only when an actor exists; provide clear thrown errors for missing actor) so POS/Menu tabs reliably demonstrate at least one backend query/mutation from the deployed URL. Verify the component's usage instructions before implementing (core-infrastructure)."
        },
        {
          "path": "frontend/src/hooks/useActor.ts",
          "operation": "modify",
          "description": "Improve actor initialization robustness for deployed environments (e.g., avoid unnecessary refetch loops; ensure anonymous actor creation works when not authenticated) so backend calls can succeed from the published URL without console-fatal runtime errors. (Do not edit immutable hook paths other than this file.) Verify the component's usage instructions before implementing (core-infrastructure)."
        }
      ]
    }
  ]
}